Switched from plantuml to mermaid for design document
